StreetCanyon-Simple/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        
        //U_ref = 3.8
        //H = 1
        //U(z) = U_ref*(z/H)^0.26
    
        name powerLawVelocity;
        
        code
        #{
            const fvPatch& boundaryPatch = patch();
    	    const vectorField& Cf = boundaryPatch.Cf();
    	    vectorField& field = *this;
    	
    	    const scalar U_ref = 3.8; 
    	    const scalar H = 0.1;
    	
    	    forAll(Cf, faceI)
    	    {
    	        const scalar y = Cf[faceI].y();
    	        
    	        field[faceI] = vector(U_ref*pow(y/H,0.26), 0, 0);
    	    };
        #};
        
    }
    
    outlet
    {
        type            zeroGradient;
    }

    topWall
    {
        type            slip;
    }
    
    ground
    {
        type            noSlip;
    }
    
    frontAndBack
    {
        type            empty;
    }    
}


// ************************************************************************* //
