StreetCanyon-Simple/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 30;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 30;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 30;
        value           uniform 30;
    }

    topWall
    {
        type            epsilonWallFunction;
        value           uniform 30;
    }
    
    ground
    {
        type            epsilonWallFunction;
        value           uniform 30;
    }
    
    frontAndBack
    {
        type            empty;
    }    
}


// ************************************************************************* //
