StreetCanyon-Simple/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 4;

boundaryField
{

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 4;
        value           uniform 4;

    }

    topWall
    {
        type            kqRWallFunction;
        value           uniform 4;
    }
    
    ground
    {
        type            kqRWallFunction;
        value           uniform 4;
    }
    
    frontAndBack
    {
        type            empty;
    }    
}


// ************************************************************************* //
