StreetCanyon-Simple/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (  0  0  0  )
    (  5  0  0  )
    (  6  0  0  )
    (  7  0  0  )
    (  8  0  0  )
    (  23 0  0  )
    (  0  1  0  )
    (  5  1  0  )
    (  6  1  0  )
    (  7  1  0  )
    (  8  1  0  )
    (  23 1  0  )  
    (  0  8  0  )
    (  5  8  0  )
    (  6  8  0  )
    (  7  8  0  )
    (  8  8  0  )
    (  23 8  0  )
    (  0  0  0.1)
    (  5  0  0.1)
    (  6  0  0.1)
    (  7  0  0.1)
    (  8  0  0.1)
    (  23 0  0.1)
    (  0  1  0.1)
    (  5  1  0.1)
    (  6  1  0.1)
    (  7  1  0.1)
    (  8  1  0.1)
    (  23 1  0.1)  
    (  0  8  0.1)
    (  5  8  0.1)
    (  6  8  0.1)
    (  7  8  0.1)
    (  8  8  0.1)
    (  23 8  0.1)        
);

blocks
(   
    hex (  0  1  7  6 18 19 25 24 ) ( 50 10 1 ) simpleGrading (1 3 1)
    hex (  2  3  9  8 20 21 27 26 ) ( 65 65 1 ) simpleGrading (1 3 1)
    hex (  4  5 11 10 22 23 29 28 ) (150 10 1 ) simpleGrading (1 3 1)
    hex (  6  7 13 12 24 25 31 30 ) ( 50 70 1 ) simpleGrading (1 1 1)
    hex (  7  8 14 13 25 26 32 31 ) ( 10 70 1 ) simpleGrading (1 1 1)
    hex (  8  9 15 14 26 27 33 32 ) ( 65 70 1 ) simpleGrading (1 1 1)
    hex (  9 10 16 15 27 28 34 33 ) ( 10 70 1 ) simpleGrading (1 1 1)
    hex ( 10 11 17 16 28 29 35 34 ) (150 70 1 ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	
    inlet
    {
        type patch;
        faces
        (
            ( 0 18 24  6)
            ( 6 24 30 12)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (  5 11 29 23 )
            ( 11 17 35 29 )
        );
    }
    
    topWall
    {
        type wall;
        faces
        (
            ( 12 30 31 13 )
            ( 13 31 32 14 )
            ( 14 32 33 15 )
            ( 15 33 34 16 )
            ( 16 34 35 17 )
        );
    }
    
    ground
    {
        type wall;
        faces
        (
            ( 0  1 19 18 )
            ( 1  7 25 19 )
            ( 7  8 26 25 )
            ( 2 20 26  8 )
            ( 2  3 21 20 )
            ( 3  9 27 21 )
            ( 9 10 28 27 )
            ( 4 22 28 10 )
            ( 4  5 23 22 )
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (  0  6  7  1 )
            (  2  8  9  3 )
            (  4 10 11  5 )
            (  6 12 13  7 )
            (  7 13 14  8 )
            (  8 14 15  9 )
            (  9 15 16 10 )
            ( 10 16 17 11 )
            ( 18 19 25 24 )
            ( 20 21 27 26 )
            ( 22 23 29 28 )
            ( 24 25 31 30 )
            ( 25 26 32 31 )
            ( 26 27 33 32 )
            ( 27 28 34 33 )
            ( 28 29 35 34 )
        );
    }
);


// ************************************************************************* //
