StreetCanyon-Simple/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scalarSource
{
    type            scalarSemiImplicitSource;
    active          true;
    
    timeStart       100;
    //updateSelection   false;
    
    duration        10000.0;

    selectionMode   cellZone;
    cellZone	    sourceCellsC2H4;

    volumeMode      absolute;

    injectionRateSuSp
    {
	T           (1.8e-3 0); // Su = 0.001 e Sp = 0
    }
}


// ************************************************************************* //
