StreetCanyon-Simple/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    sourceCellsC2H4;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.648 0 0) (0.652 0.005 0.01);
        }
    }
    
        {
        name    sourceCellsC2H4;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set sourceCellsC2H4;
        }
    }
);



// ************************************************************************* //
